TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_xbar.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG8 register
//
//*************************************************************************************************
#define XBAR_FLG8_EPWM1_TRIPOUT    0x1U       // Input Flag for EPWM1_TRIPOUT Signal
#define XBAR_FLG8_EPWM2_TRIPOUT    0x2U       // Input Flag for EPWM2_TRIPOUT Signal
#define XBAR_FLG8_EPWM3_TRIPOUT    0x4U       // Input Flag for EPWM3_TRIPOUT Signal
#define XBAR_FLG8_EPWM4_TRIPOUT    0x8U       // Input Flag for EPWM4_TRIPOUT Signal
#define XBAR_FLG8_EPWM5_TRIPOUT    0x10U      // Input Flag for EPWM5_TRIPOUT Signal
#define XBAR_FLG8_EPWM6_TRIPOUT    0x20U      // Input Flag for EPWM6_TRIPOUT Signal
#define XBAR_FLG8_EPWM7_TRIPOUT    0x40U      // Input Flag for EPWM7_TRIPOUT Signal
#define XBAR_FLG8_EPWM8_TRIPOUT    0x80U      // Input Flag for EPWM8_TRIPOUT Signal
#define XBAR_FLG8_EPWM9_TRIPOUT    0x100U     // Input Flag for EPWM9_TRIPOUT Signal
#define XBAR_FLG8_EPWM10_TRIPOUT   0x200U     // Input Flag for EPWM10_TRIPOUT Signal
#define XBAR_FLG8_EPWM11_TRIPOUT   0x400U     // Input Flag for EPWM11_TRIPOUT Signal
#define XBAR_FLG8_EPWM12_TRIPOUT   0x800U     // Input Flag for EPWM12_TRIPOUT Signal
#define XBAR_FLG8_EPWM13_TRIPOUT   0x1000U    // Input Flag for EPWM13_TRIPOUT Signal
#define XBAR_FLG8_EPWM14_TRIPOUT   0x2000U    // Input Flag for EPWM14_TRIPOUT Signal
#define XBAR_FLG8_EPWM15_TRIPOUT   0x4000U    // Input Flag for EPWM15_TRIPOUT Signal
#define XBAR_FLG8_EPWM16_TRIPOUT   0x8000U    // Input Flag for EPWM16_TRIPOUT Signal
#define XBAR_FLG8_EPWM17_TRIPOUT   0x10000U   // Input Flag for EPWM17_TRIPOUT Signal
#define XBAR_FLG8_EPWM18_TRIPOUT   0x20000U   // Input Flag for EPWM18_TRIPOUT Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG9 register
//
//*************************************************************************************************
#define XBAR_FLG9_EPWM1_DEL_TRIP    0x1U       // Input Flag for EPWM1_DEL_TRIP Signal
#define XBAR_FLG9_EPWM2_DEL_TRIP    0x2U       // Input Flag for EPWM2_DEL_TRIP Signal
#define XBAR_FLG9_EPWM3_DEL_TRIP    0x4U       // Input Flag for EPWM3_DEL_TRIP Signal
#define XBAR_FLG9_EPWM4_DEL_TRIP    0x8U       // Input Flag for EPWM4_DEL_TRIP Signal
#define XBAR_FLG9_EPWM5_DEL_TRIP    0x10U      // Input Flag for EPWM5_DEL_TRIP Signal
#define XBAR_FLG9_EPWM6_DEL_TRIP    0x20U      // Input Flag for EPWM6_DEL_TRIP Signal
#define XBAR_FLG9_EPWM7_DEL_TRIP    0x40U      // Input Flag for EPWM7_DEL_TRIP Signal
#define XBAR_FLG9_EPWM8_DEL_TRIP    0x80U      // Input Flag for EPWM8_DEL_TRIP Signal
#define XBAR_FLG9_EPWM9_DEL_TRIP    0x100U     // Input Flag for EPWM9_DEL_TRIP Signal
#define XBAR_FLG9_EPWM10_DEL_TRIP   0x200U     // Input Flag for EPWM10_DEL_TRIP Signal
#define XBAR_FLG9_EPWM11_DEL_TRIP   0x400U     // Input Flag for EPWM11_DEL_TRIP Signal
#define XBAR_FLG9_EPWM12_DEL_TRIP   0x800U     // Input Flag for EPWM12_DEL_TRIP Signal
#define XBAR_FLG9_EPWM13_DEL_TRIP   0x1000U    // Input Flag for EPWM13_DEL_TRIP Signal
#define XBAR_FLG9_EPWM14_DEL_TRIP   0x2000U    // Input Flag for EPWM14_DEL_TRIP Signal
#define XBAR_FLG9_EPWM15_DEL_TRIP   0x4000U    // Input Flag for EPWM15_DEL_TRIP Signal
#define XBAR_FLG9_EPWM16_DEL_TRIP   0x8000U    // Input Flag for EPWM16_DEL_TRIP Signal
#define XBAR_FLG9_EPWM17_DEL_TRIP   0x10000U   // Input Flag for EPWM17_DEL_TRIP Signal
#define XBAR_FLG9_EPWM18_DEL_TRIP   0x20000U   // Input Flag for EPWM18_DEL_TRIP Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG10 register
//
//*************************************************************************************************
#define XBAR_FLG10_EPWM1_DEL_ACTIVE    0x1U       // Input Flag for EPWM1_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM2_DEL_ACTIVE    0x2U       // Input Flag for EPWM2_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM3_DEL_ACTIVE    0x4U       // Input Flag for EPWM3_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM4_DEL_ACTIVE    0x8U       // Input Flag for EPWM4_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM5_DEL_ACTIVE    0x10U      // Input Flag for EPWM5_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM6_DEL_ACTIVE    0x20U      // Input Flag for EPWM6_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM7_DEL_ACTIVE    0x40U      // Input Flag for EPWM7_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM8_DEL_ACTIVE    0x80U      // Input Flag for EPWM8_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM9_DEL_ACTIVE    0x100U     // Input Flag for EPWM9_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM10_DEL_ACTIVE   0x200U     // Input Flag for EPWM10_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM11_DEL_ACTIVE   0x400U     // Input Flag for EPWM11_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM12_DEL_ACTIVE   0x800U     // Input Flag for EPWM12_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM13_DEL_ACTIVE   0x1000U    // Input Flag for EPWM13_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM14_DEL_ACTIVE   0x2000U    // Input Flag for EPWM14_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM15_DEL_ACTIVE   0x4000U    // Input Flag for EPWM15_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM16_DEL_ACTIVE   0x8000U    // Input Flag for EPWM16_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM17_DEL_ACTIVE   0x10000U   // Input Flag for EPWM17_DEL_ACTIVE Signal
#define XBAR_FLG10_EPWM18_DEL_ACTIVE   0x20000U   // Input Flag for EPWM18_DEL_ACTIVE Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG11 register
//
//*************************************************************************************************
#define XBAR_FLG11_EPWM1_A0_SCLK    0x1U          // Input Flag for EPWM1_A0_sclk Signal
#define XBAR_FLG11_EPWM1_B0_SCLK    0x2U          // Input Flag for EPWM1_B0_sclk Signal
#define XBAR_FLG11_EPWM2_A0_SCLK    0x4U          // Input Flag for EPWM2_A0_sclk Signal
#define XBAR_FLG11_EPWM2_B0_SCLK    0x8U          // Input Flag for EPWM2_B0_sclk Signal
#define XBAR_FLG11_EPWM3_A0_SCLK    0x10U         // Input Flag for EPWM3_A0_sclk Signal
#define XBAR_FLG11_EPWM3_B0_SCLK    0x20U         // Input Flag for EPWM3_B0_sclk Signal
#define XBAR_FLG11_EPWM4_A0_SCLK    0x40U         // Input Flag for EPWM4_A0_sclk Signal
#define XBAR_FLG11_EPWM4_B0_SCLK    0x80U         // Input Flag for EPWM4_B0_sclk Signal
#define XBAR_FLG11_EPWM5_A0_SCLK    0x100U        // Input Flag for EPWM5_A0_sclk Signal
#define XBAR_FLG11_EPWM5_B0_SCLK    0x200U        // Input Flag for EPWM5_B0_sclk Signal
#define XBAR_FLG11_EPWM6_A0_SCLK    0x400U        // Input Flag for EPWM6_A0_sclk Signal
#define XBAR_FLG11_EPWM6_B0_SCLK    0x800U        // Input Flag for EPWM6_B0_sclk Signal
#define XBAR_FLG11_EPWM7_A0_SCLK    0x1000U       // Input Flag for EPWM7_A0_sclk Signal
#define XBAR_FLG11_EPWM7_B0_SCLK    0x2000U       // Input Flag for EPWM7_B0_sclk Signal
#define XBAR_FLG11_EPWM8_A0_SCLK    0x4000U       // Input Flag for EPWM8_A0_sclk Signal
#define XBAR_FLG11_EPWM8_B0_SCLK    0x8000U       // Input Flag for EPWM8_B0_sclk Signal
#define XBAR_FLG11_EPWM9_A0_SCLK    0x10000U      // Input Flag for EPWM9_A0_sclk Signal
#define XBAR_FLG11_EPWM9_B0_SCLK    0x20000U      // Input Flag for EPWM9_B0_sclk Signal
#define XBAR_FLG11_EPWM10_A0_SCLK   0x40000U      // Input Flag for EPWM10_A0_sclk Signal
#define XBAR_FLG11_EPWM10_B0_SCLK   0x80000U      // Input Flag for EPWM10_B0_sclk Signal
#define XBAR_FLG11_EPWM11_A0_SCLK   0x100000U     // Input Flag for EPWM11_A0_sclk Signal
#define XBAR_FLG11_EPWM11_B0_SCLK   0x200000U     // Input Flag for EPWM11_B0_sclk Signal
#define XBAR_FLG11_EPWM12_A0_SCLK   0x400000U     // Input Flag for EPWM12_A0_sclk Signal
#define XBAR_FLG11_EPWM12_B0_SCLK   0x800000U     // Input Flag for EPWM12_B0_sclk Signal
#define XBAR_FLG11_EPWM13_A0_SCLK   0x1000000U    // Input Flag for EPWM13_A0_sclk Signal
#define XBAR_FLG11_EPWM13_B0_SCLK   0x2000000U    // Input Flag for EPWM13_B0_sclk Signal
#define XBAR_FLG11_EPWM14_A0_SCLK   0x4000000U    // Input Flag for EPWM14_A0_sclk Signal
#define XBAR_FLG11_EPWM14_B0_SCLK   0x8000000U    // Input Flag for EPWM14_B0_sclk Signal
#define XBAR_FLG11_EPWM15_A0_SCLK   0x10000000U   // Input Flag for EPWM15_A0_sclk Signal
#define XBAR_FLG11_EPWM15_B0_SCLK   0x20000000U   // Input Flag for EPWM15_B0_sclk Signal
#define XBAR_FLG11_EPWM16_A0_SCLK   0x40000000U   // Input Flag for EPWM16_A0_sclk Signal
#define XBAR_FLG11_EPWM16_B0_SCLK   0x80000000U   // Input Flag for EPWM16_B0_sclk Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG12 register
//
//*************************************************************************************************
#define XBAR_FLG12_EPWM17_A0_SCLK   0x1U   // Input Flag for EPWM17_A0_sclk Signal
#define XBAR_FLG12_EPWM17_B0_SCLK   0x2U   // Input Flag for EPWM17_B0_sclk Signal
#define XBAR_FLG12_EPWM18_A0_SCLK   0x4U   // Input Flag for EPWM18_A0_sclk Signal
#define XBAR_FLG12_EPWM18_B0_SCLK   0x8U   // Input Flag for EPWM18_B0_sclk Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG13 register
//
//*************************************************************************************************
#define XBAR_FLG13_MDL1_OUTA    0x1U          // Input Flag for MDL1_OUTA Signal
#define XBAR_FLG13_MDL1_OUTB    0x2U          // Input Flag for MDL1_OUTB Signal
#define XBAR_FLG13_MDL2_OUTA    0x4U          // Input Flag for MDL2_OUTA Signal
#define XBAR_FLG13_MDL2_OUTB    0x8U          // Input Flag for MDL2_OUTB Signal
#define XBAR_FLG13_MDL3_OUTA    0x10U         // Input Flag for MDL3_OUTA Signal
#define XBAR_FLG13_MDL3_OUTB    0x20U         // Input Flag for MDL3_OUTB Signal
#define XBAR_FLG13_MDL4_OUTA    0x40U         // Input Flag for MDL4_OUTA Signal
#define XBAR_FLG13_MDL4_OUTB    0x80U         // Input Flag for MDL4_OUTB Signal
#define XBAR_FLG13_MDL5_OUTA    0x100U        // Input Flag for MDL5_OUTA Signal
#define XBAR_FLG13_MDL5_OUTB    0x200U        // Input Flag for MDL5_OUTB Signal
#define XBAR_FLG13_MDL6_OUTA    0x400U        // Input Flag for MDL6_OUTA Signal
#define XBAR_FLG13_MDL6_OUTB    0x800U        // Input Flag for MDL6_OUTB Signal
#define XBAR_FLG13_MDL7_OUTA    0x1000U       // Input Flag for MDL7_OUTA Signal
#define XBAR_FLG13_MDL7_OUTB    0x2000U       // Input Flag for MDL7_OUTB Signal
#define XBAR_FLG13_MDL8_OUTA    0x4000U       // Input Flag for MDL8_OUTA Signal
#define XBAR_FLG13_MDL8_OUTB    0x8000U       // Input Flag for MDL8_OUTB Signal
#define XBAR_FLG13_MDL9_OUTA    0x10000U      // Input Flag for MDL9_OUTA Signal
#define XBAR_FLG13_MDL9_OUTB    0x20000U      // Input Flag for MDL9_OUTB Signal
#define XBAR_FLG13_MDL10_OUTA   0x40000U      // Input Flag for MDL10_OUTA Signal
#define XBAR_FLG13_MDL10_OUTB   0x80000U      // Input Flag for MDL10_OUTB Signal
#define XBAR_FLG13_MDL11_OUTA   0x100000U     // Input Flag for MDL11_OUTA Signal
#define XBAR_FLG13_MDL11_OUTB   0x200000U     // Input Flag for MDL11_OUTB Signal
#define XBAR_FLG13_MDL12_OUTA   0x400000U     // Input Flag for MDL12_OUTA Signal
#define XBAR_FLG13_MDL12_OUTB   0x800000U     // Input Flag for MDL12_OUTB Signal
#define XBAR_FLG13_MDL13_OUTA   0x1000000U    // Input Flag for MDL13_OUTA Signal
#define XBAR_FLG13_MDL13_OUTB   0x2000000U    // Input Flag for MDL13_OUTB Signal
#define XBAR_FLG13_MDL14_OUTA   0x4000000U    // Input Flag for MDL14_OUTA Signal
#define XBAR_FLG13_MDL14_OUTB   0x8000000U    // Input Flag for MDL14_OUTB Signal
#define XBAR_FLG13_MDL15_OUTA   0x10000000U   // Input Flag for MDL15_OUTA Signal
#define XBAR_FLG13_MDL15_OUTB   0x20000000U   // Input Flag for MDL15_OUTB Signal
#define XBAR_FLG13_MDL16_OUTA   0x40000000U   // Input Flag for MDL16_OUTA Signal
#define XBAR_FLG13_MDL16_OUTB   0x80000000U   // Input Flag for MDL16_OUTB Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG14 register
//
//*************************************************************************************************
#define XBAR_FLG14_MDL17_OUTA   0x1U   // Input Flag for MDL17_OUTA Signal
#define XBAR_FLG14_MDL17_OUTB   0x2U   // Input Flag for MDL17_OUTB Signal
#define XBAR_FLG14_MDL18_OUTA   0x4U   // Input Flag for MDL18_OUTA Signal
#define XBAR_FLG14_MDL18_OUTB   0x8U   // Input Flag for MDL18_OUTB Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG15 register
//
//*************************************************************************************************
#define XBAR_FLG15_CLB1_OUT0   0x1U          // Input Flag for CLB1_OUT0 Signal
#define XBAR_FLG15_CLB1_OUT1   0x2U          // Input Flag for CLB1_OUT1 Signal
#define XBAR_FLG15_CLB1_OUT2   0x4U          // Input Flag for CLB1_OUT2 Signal
#define XBAR_FLG15_CLB1_OUT3   0x8U          // Input Flag for CLB1_OUT3 Signal
#define XBAR_FLG15_CLB1_OUT6   0x10U         // Input Flag for CLB1_OUT6 Signal
#define XBAR_FLG15_CLB1_OUT7   0x20U         // Input Flag for CLB1_OUT7 Signal
#define XBAR_FLG15_CLB2_OUT0   0x40U         // Input Flag for CLB2_OUT0 Signal
#define XBAR_FLG15_CLB2_OUT1   0x80U         // Input Flag for CLB2_OUT1 Signal
#define XBAR_FLG15_CLB2_OUT2   0x100U        // Input Flag for CLB2_OUT2 Signal
#define XBAR_FLG15_CLB2_OUT3   0x200U        // Input Flag for CLB2_OUT3 Signal
#define XBAR_FLG15_CLB2_OUT6   0x400U        // Input Flag for CLB2_OUT6 Signal
#define XBAR_FLG15_CLB2_OUT7   0x800U        // Input Flag for CLB2_OUT7 Signal
#define XBAR_FLG15_CLB3_OUT0   0x1000U       // Input Flag for CLB3_OUT0 Signal
#define XBAR_FLG15_CLB3_OUT1   0x2000U       // Input Flag for CLB3_OUT1 Signal
#define XBAR_FLG15_CLB3_OUT2   0x4000U       // Input Flag for CLB3_OUT2 Signal
#define XBAR_FLG15_CLB3_OUT3   0x8000U       // Input Flag for CLB3_OUT3 Signal
#define XBAR_FLG15_CLB3_OUT6   0x10000U      // Input Flag for CLB3_OUT6 Signal
#define XBAR_FLG15_CLB3_OUT7   0x20000U      // Input Flag for CLB3_OUT7 Signal
#define XBAR_FLG15_CLB4_OUT0   0x40000U      // Input Flag for CLB4_OUT0 Signal
#define XBAR_FLG15_CLB4_OUT1   0x80000U      // Input Flag for CLB4_OUT1 Signal
#define XBAR_FLG15_CLB4_OUT2   0x100000U     // Input Flag for CLB4_OUT2 Signal
#define XBAR_FLG15_CLB4_OUT3   0x200000U     // Input Flag for CLB4_OUT3 Signal
#define XBAR_FLG15_CLB4_OUT6   0x400000U     // Input Flag for CLB4_OUT6 Signal
#define XBAR_FLG15_CLB4_OUT7   0x800000U     // Input Flag for CLB4_OUT7 Signal
#define XBAR_FLG15_CLB5_OUT0   0x1000000U    // Input Flag for CLB5_OUT0 Signal
#define XBAR_FLG15_CLB5_OUT1   0x2000000U    // Input Flag for CLB5_OUT1 Signal
#define XBAR_FLG15_CLB5_OUT2   0x4000000U    // Input Flag for CLB5_OUT2 Signal
#define XBAR_FLG15_CLB5_OUT3   0x8000000U    // Input Flag for CLB5_OUT3 Signal
#define XBAR_FLG15_CLB5_OUT6   0x10000000U   // Input Flag for CLB5_OUT6 Signal
#define XBAR_FLG15_CLB5_OUT7   0x20000000U   // Input Flag for CLB5_OUT7 Signal
#define XBAR_FLG15_CLB6_OUT0   0x40000000U   // Input Flag for CLB6_OUT0 Signal
#define XBAR_FLG15_CLB6_OUT1   0x80000000U   // Input Flag for CLB6_OUT1 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG16 register
//
//*************************************************************************************************
#define XBAR_FLG16_CLB6_OUT2         0x1U          // Input Flag for CLB6_OUT2 Signal
#define XBAR_FLG16_CLB6_OUT3         0x2U          // Input Flag for CLB6_OUT3 Signal
#define XBAR_FLG16_CLB6_OUT6         0x4U          // Input Flag for CLB6_OUT6 Signal
#define XBAR_FLG16_CLB6_OUT7         0x8U          // Input Flag for CLB6_OUT7 Signal
#define XBAR_FLG16_ADCA_EXTMUXSEL0   0x10U         // Input Flag for ADCA_EXTMUXSEL0 Signal
#define XBAR_FLG16_ADCA_EXTMUXSEL1   0x20U         // Input Flag for ADCA_EXTMUXSEL1 Signal
#define XBAR_FLG16_ADCA_EXTMUXSEL2   0x40U         // Input Flag for ADCA_EXTMUXSEL2 Signal
#define XBAR_FLG16_ADCA_EXTMUXSEL3   0x80U         // Input Flag for ADCA_EXTMUXSEL3 Signal
#define XBAR_FLG16_ADCB_EXTMUXSEL0   0x100U        // Input Flag for ADCB_EXTMUXSEL0 Signal
#define XBAR_FLG16_ADCB_EXTMUXSEL1   0x200U        // Input Flag for ADCB_EXTMUXSEL1 Signal
#define XBAR_FLG16_ADCB_EXTMUXSEL2   0x400U        // Input Flag for ADCB_EXTMUXSEL2 Signal
#define XBAR_FLG16_ADCB_EXTMUXSEL3   0x800U        // Input Flag for ADCB_EXTMUXSEL3 Signal
#define XBAR_FLG16_ADCC_EXTMUXSEL0   0x1000U       // Input Flag for ADCC_EXTMUXSEL0 Signal
#define XBAR_FLG16_ADCC_EXTMUXSEL1   0x2000U       // Input Flag for ADCC_EXTMUXSEL1 Signal
#define XBAR_FLG16_ADCC_EXTMUXSEL2   0x4000U       // Input Flag for ADCC_EXTMUXSEL2 Signal
#define XBAR_FLG16_ADCC_EXTMUXSEL3   0x8000U       // Input Flag for ADCC_EXTMUXSEL3 Signal
#define XBAR_FLG16_ADCD_EXTMUXSEL0   0x10000U      // Input Flag for ADCD_EXTMUXSEL0 Signal
#define XBAR_FLG16_ADCD_EXTMUXSEL1   0x20000U      // Input Flag for ADCD_EXTMUXSEL1 Signal
#define XBAR_FLG16_ADCD_EXTMUXSEL2   0x40000U      // Input Flag for ADCD_EXTMUXSEL2 Signal
#define XBAR_FLG16_ADCD_EXTMUXSEL3   0x80000U      // Input Flag for ADCD_EXTMUXSEL3 Signal
#define XBAR_FLG16_ADCE_EXTMUXSEL0   0x100000U     // Input Flag for ADCE_EXTMUXSEL0 Signal
#define XBAR_FLG16_ADCE_EXTMUXSEL1   0x200000U     // Input Flag for ADCE_EXTMUXSEL1 Signal
#define XBAR_FLG16_ADCE_EXTMUXSEL2   0x400000U     // Input Flag for ADCE_EXTMUXSEL2 Signal
#define XBAR_FLG16_ADCE_EXTMUXSEL3   0x800000U     // Input Flag for ADCE_EXTMUXSEL3 Signal
#define XBAR_FLG16_EPG1_EPGOUT0      0x10000000U   // Input Flag for EPG1_EPGOUT0 Signal
#define XBAR_FLG16_EPG1_EPGOUT1      0x20000000U   // Input Flag for EPG1_EPGOUT1 Signal
#define XBAR_FLG16_EPG1_EPGOUT2      0x40000000U   // Input Flag for EPG1_EPGOUT2 Signal
#define XBAR_FLG16_EPG1_EPGOUT3      0x80000000U   // Input Flag for EPG1_EPGOUT3 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG17 register
//
//*************************************************************************************************
#define XBAR_FLG17_MCANA_FEVT0   0x1U       // Input Flag for MCANA_FEVT0 Signal
#define XBAR_FLG17_MCANA_FEVT1   0x2U       // Input Flag for MCANA_FEVT1 Signal
#define XBAR_FLG17_MCANA_FEVT2   0x4U       // Input Flag for MCANA_FEVT2 Signal
#define XBAR_FLG17_MCANB_FEVT0   0x8U       // Input Flag for MCANB_FEVT0 Signal
#define XBAR_FLG17_MCANB_FEVT1   0x10U      // Input Flag for MCANB_FEVT1 Signal
#define XBAR_FLG17_MCANB_FEVT2   0x20U      // Input Flag for MCANB_FEVT2 Signal
#define XBAR_FLG17_MCANC_FEVT0   0x40U      // Input Flag for MCANC_FEVT0 Signal
#define XBAR_FLG17_MCANC_FEVT1   0x80U      // Input Flag for MCANC_FEVT1 Signal
#define XBAR_FLG17_MCANC_FEVT2   0x100U     // Input Flag for MCANC_FEVT2 Signal
#define XBAR_FLG17_MCAND_FEVT0   0x200U     // Input Flag for MCAND_FEVT0 Signal
#define XBAR_FLG17_MCAND_FEVT1   0x400U     // Input Flag for MCAND_FEVT1 Signal
#define XBAR_FLG17_MCAND_FEVT2   0x800U     // Input Flag for MCAND_FEVT2 Signal
#define XBAR_FLG17_MCANE_FEVT0   0x1000U    // Input Flag for MCANE_FEVT0 Signal
#define XBAR_FLG17_MCANE_FEVT1   0x2000U    // Input Flag for MCANE_FEVT1 Signal
#define XBAR_FLG17_MCANE_FEVT2   0x4000U    // Input Flag for MCANE_FEVT2 Signal
#define XBAR_FLG17_MCANF_FEVT0   0x8000U    // Input Flag for MCANF_FEVT0 Signal
#define XBAR_FLG17_MCANF_FEVT1   0x10000U   // Input Flag for MCANF_FEVT1 Signal
#define XBAR_FLG17_MCANF_FEVT2   0x20000U   // Input Flag for MCANF_FEVT2 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARFLG18 register
//
//*************************************************************************************************
#define XBAR_FLG18_FSIRXA_TRIG_2   0x1U       // Input Flag for FSIRXA_TRIG_2 Signal
#define XBAR_FLG18_FSIRXA_TRIG_3   0x2U       // Input Flag for FSIRXA_TRIG_3 Signal
#define XBAR_FLG18_FSIRXB_TRIG_2   0x4U       // Input Flag for FSIRXB_TRIG_2 Signal
#define XBAR_FLG18_FSIRXB_TRIG_3   0x8U       // Input Flag for FSIRXB_TRIG_3 Signal
#define XBAR_FLG18_FSIRXC_TRIG_2   0x10U      // Input Flag for FSIRXC_TRIG_2 Signal
#define XBAR_FLG18_FSIRXC_TRIG_3   0x20U      // Input Flag for FSIRXC_TRIG_3 Signal
#define XBAR_FLG18_FSIRXD_TRIG_2   0x40U      // Input Flag for FSIRXD_TRIG_2 Signal
#define XBAR_FLG18_FSIRXD_TRIG_3   0x80U      // Input Flag for FSIRXD_TRIG_3 Signal
#define XBAR_FLG18_CPU1ERADEVT8    0x100U     // Input Flag for CPU1ERADEVT8 Signal
#define XBAR_FLG18_CPU1ERADEVT9    0x200U     // Input Flag for CPU1ERADEVT9 Signal
#define XBAR_FLG18_CPU1ERADEVT10   0x400U     // Input Flag for CPU1ERADEVT10 Signal
#define XBAR_FLG18_CPU1ERADEVT11   0x800U     // Input Flag for CPU1ERADEVT11 Signal
#define XBAR_FLG18_CPU2ERADEVT8    0x1000U    // Input Flag for CPU2ERADEVT8 Signal
#define XBAR_FLG18_CPU2ERADEVT9    0x2000U    // Input Flag for CPU2ERADEVT9 Signal
#define XBAR_FLG18_CPU2ERADEVT10   0x4000U    // Input Flag for CPU2ERADEVT10 Signal
#define XBAR_FLG18_CPU2ERADEVT11   0x8000U    // Input Flag for CPU2ERADEVT11 Signal
#define XBAR_FLG18_CPU3ERADEVT8    0x10000U   // Input Flag for CPU3ERADEVT8 Signal
#define XBAR_FLG18_CPU3ERADEVT9    0x20000U   // Input Flag for CPU3ERADEVT9 Signal
#define XBAR_FLG18_CPU3ERADEVT10   0x40000U   // Input Flag for CPU3ERADEVT10 Signal
#define XBAR_FLG18_CPU3ERADEVT11   0x80000U   // Input Flag for CPU3ERADEVT11 Signal

