TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_xbar.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR1 register
//
//*************************************************************************************************
#define XBAR_CLR1_CMPSS1_CTRIPL    0x1U        // Input Flag Clear for CMPSS1_CTRIPL Signal
#define XBAR_CLR1_CMPSS1_CTRIPH    0x2U        // Input Flag Clear for CMPSS1_CTRIPH Signal
#define XBAR_CLR1_CMPSS2_CTRIPL    0x4U        // Input Flag Clear for CMPSS2_CTRIPL Signal
#define XBAR_CLR1_CMPSS2_CTRIPH    0x8U        // Input Flag Clear for CMPSS2_CTRIPH Signal
#define XBAR_CLR1_CMPSS3_CTRIPL    0x10U       // Input Flag Clear for CMPSS3_CTRIPL Signal
#define XBAR_CLR1_CMPSS3_CTRIPH    0x20U       // Input Flag Clear for CMPSS3_CTRIPH Signal
#define XBAR_CLR1_CMPSS4_CTRIPL    0x40U       // Input Flag Clear for CMPSS4_CTRIPL Signal
#define XBAR_CLR1_CMPSS4_CTRIPH    0x80U       // Input Flag Clear for CMPSS4_CTRIPH Signal
#define XBAR_CLR1_CMPSS5_CTRIPL    0x100U      // Input Flag Clear for CMPSS5_CTRIPL Signal
#define XBAR_CLR1_CMPSS5_CTRIPH    0x200U      // Input Flag Clear for CMPSS5_CTRIPH Signal
#define XBAR_CLR1_CMPSS6_CTRIPL    0x400U      // Input Flag Clear for CMPSS6_CTRIPL Signal
#define XBAR_CLR1_CMPSS6_CTRIPH    0x800U      // Input Flag Clear for CMPSS6_CTRIPH Signal
#define XBAR_CLR1_CMPSS7_CTRIPL    0x1000U     // Input Flag Clear for CMPSS7_CTRIPL Signal
#define XBAR_CLR1_CMPSS7_CTRIPH    0x2000U     // Input Flag Clear for CMPSS7_CTRIPH Signal
#define XBAR_CLR1_CMPSS8_CTRIPL    0x4000U     // Input Flag Clear for CMPSS8_CTRIPL Signal
#define XBAR_CLR1_CMPSS8_CTRIPH    0x8000U     // Input Flag Clear for CMPSS8_CTRIPH Signal
#define XBAR_CLR1_CMPSS9_CTRIPH    0x10000U    // Input Flag Clear for CMPSS9_CTRIPH Signal
#define XBAR_CLR1_CMPSS9_CTRIPL    0x20000U    // Input Flag Clear for CMPSS9_CTRIPL Signal
#define XBAR_CLR1_CMPSS10_CTRIPH   0x40000U    // Input Flag Clear for CMPSS10_CTRIPH Signal
#define XBAR_CLR1_CMPSS10_CTRIPL   0x80000U    // Input Flag Clear for CMPSS10_CTRIPL Signal
#define XBAR_CLR1_CMPSS11_CTRIPH   0x100000U   // Input Flag Clear for CMPSS11_CTRIPH Signal
#define XBAR_CLR1_CMPSS11_CTRIPL   0x200000U   // Input Flag Clear for CMPSS11_CTRIPL Signal
#define XBAR_CLR1_CMPSS12_CTRIPH   0x400000U   // Input Flag Clear for CMPSS12_CTRIPH Signal
#define XBAR_CLR1_CMPSS12_CTRIPL   0x800000U   // Input Flag Clear for CMPSS12_CTRIPL Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR2 register
//
//*************************************************************************************************
#define XBAR_CLR2_CMPSS1_CTRIPOUTL    0x1U        // Input Flag clear for CMPSS1_CTRIPOUTL Signal
#define XBAR_CLR2_CMPSS1_CTRIPOUTH    0x2U        // Input Flag clear for CMPSS1_CTRIPOUTH Signal
#define XBAR_CLR2_CMPSS2_CTRIPOUTL    0x4U        // Input Flag clear for CMPSS2_CTRIPOUTL Signal
#define XBAR_CLR2_CMPSS2_CTRIPOUTH    0x8U        // Input Flag clear for CMPSS2_CTRIPOUTH Signal
#define XBAR_CLR2_CMPSS3_CTRIPOUTL    0x10U       // Input Flag clear for CMPSS3_CTRIPOUTL Signal
#define XBAR_CLR2_CMPSS3_CTRIPOUTH    0x20U       // Input Flag clear for CMPSS3_CTRIPOUTH Signal
#define XBAR_CLR2_CMPSS4_CTRIPOUTL    0x40U       // Input Flag clear for CMPSS4_CTRIPOUTL Signal
#define XBAR_CLR2_CMPSS4_CTRIPOUTH    0x80U       // Input Flag clear for CMPSS4_CTRIPOUTH Signal
#define XBAR_CLR2_CMPSS5_CTRIPOUTL    0x100U      // Input Flag clear for CMPSS5_CTRIPOUTL Signal
#define XBAR_CLR2_CMPSS5_CTRIPOUTH    0x200U      // Input Flag clear for CMPSS5_CTRIPOUTH Signal
#define XBAR_CLR2_CMPSS6_CTRIPOUTL    0x400U      // Input Flag clear for CMPSS6_CTRIPOUTL Signal
#define XBAR_CLR2_CMPSS6_CTRIPOUTH    0x800U      // Input Flag clear for CMPSS6_CTRIPOUTH Signal
#define XBAR_CLR2_CMPSS7_CTRIPOUTL    0x1000U     // Input Flag clear for CMPSS7_CTRIPOUTL Signal
#define XBAR_CLR2_CMPSS7_CTRIPOUTH    0x2000U     // Input Flag clear for CMPSS7_CTRIPOUTH Signal
#define XBAR_CLR2_CMPSS8_CTRIPOUTL    0x4000U     // Input Flag clear for CMPSS8_CTRIPOUTL Signal
#define XBAR_CLR2_CMPSS8_CTRIPOUTH    0x8000U     // Input Flag clear for CMPSS8_CTRIPOUTH Signal
#define XBAR_CLR2_CMPSS9_CTRIPOUTH    0x10000U    // Input Flag clear for CMPSS9_CTRIPOUTH Signal
#define XBAR_CLR2_CMPSS9_CTRIPOUTL    0x20000U    // Input Flag clear for CMPSS9_CTRIPOUTL Signal
#define XBAR_CLR2_CMPSS10_CTRIPOUTH   0x40000U    // Input Flag clear for CMPSS10_CTRIPOUTH Signal
#define XBAR_CLR2_CMPSS10_CTRIPOUTL   0x80000U    // Input Flag clear for CMPSS10_CTRIPOUTL Signal
#define XBAR_CLR2_CMPSS11_CTRIPOUTH   0x100000U   // Input Flag clear for CMPSS11_CTRIPOUTH Signal
#define XBAR_CLR2_CMPSS11_CTRIPOUTL   0x200000U   // Input Flag clear for CMPSS11_CTRIPOUTL Signal
#define XBAR_CLR2_CMPSS12_CTRIPOUTH   0x400000U   // Input Flag clear for CMPSS12_CTRIPOUTH Signal
#define XBAR_CLR2_CMPSS12_CTRIPOUTL   0x800000U   // Input Flag clear for CMPSS12_CTRIPOUTL Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR3 register
//
//*************************************************************************************************
#define XBAR_CLR3_SD1FLT1_COMPL   0x1U          // Input Flag Clear for SD1FLT1_COMPL Signal
#define XBAR_CLR3_SD1FLT1_COMPH   0x2U          // Input Flag Clear for SD1FLT1_COMPH Signal
#define XBAR_CLR3_SD1FLT2_COMPL   0x4U          // Input Flag Clear for SD1FLT2_COMPL Signal
#define XBAR_CLR3_SD1FLT2_COMPH   0x8U          // Input Flag Clear for SD1FLT2_COMPH Signal
#define XBAR_CLR3_SD1FLT3_COMPL   0x10U         // Input Flag Clear for SD1FLT3_COMPL Signal
#define XBAR_CLR3_SD1FLT3_COMPH   0x20U         // Input Flag Clear for SD1FLT3_COMPH Signal
#define XBAR_CLR3_SD1FLT4_COMPL   0x40U         // Input Flag Clear for SD1FLT4_COMPL Signal
#define XBAR_CLR3_SD1FLT4_COMPH   0x80U         // Input Flag Clear for SD1FLT4_COMPH Signal
#define XBAR_CLR3_SD2FLT1_COMPL   0x100U        // Input Flag Clear for SD2FLT1_COMPL Signal
#define XBAR_CLR3_SD2FLT1_COMPH   0x200U        // Input Flag Clear for SD2FLT1_COMPH Signal
#define XBAR_CLR3_SD2FLT2_COMPL   0x400U        // Input Flag Clear for SD2FLT2_COMPL Signal
#define XBAR_CLR3_SD2FLT2_COMPH   0x800U        // Input Flag Clear for SD2FLT2_COMPH Signal
#define XBAR_CLR3_SD2FLT3_COMPL   0x1000U       // Input Flag Clear for SD2FLT3_COMPL Signal
#define XBAR_CLR3_SD2FLT3_COMPH   0x2000U       // Input Flag Clear for SD2FLT3_COMPH Signal
#define XBAR_CLR3_SD2FLT4_COMPL   0x4000U       // Input Flag Clear for SD2FLT4_COMPL Signal
#define XBAR_CLR3_SD2FLT4_COMPH   0x8000U       // Input Flag Clear for SD2FLT4_COMPH Signal
#define XBAR_CLR3_SD3FLT1_COMPH   0x10000U      // Input Flag Clear for SD3FLT1_COMPH Signal
#define XBAR_CLR3_SD3FLT1_COMPL   0x20000U      // Input Flag Clear for SD3FLT1_COMPL Signal
#define XBAR_CLR3_SD3FLT2_COMPH   0x40000U      // Input Flag Clear for SD3FLT2_COMPH Signal
#define XBAR_CLR3_SD3FLT2_COMPL   0x80000U      // Input Flag Clear for SD3FLT2_COMPL Signal
#define XBAR_CLR3_SD3FLT3_COMPH   0x100000U     // Input Flag Clear for SD3FLT3_COMPH Signal
#define XBAR_CLR3_SD3FLT3_COMPL   0x200000U     // Input Flag Clear for SD3FLT3_COMPL Signal
#define XBAR_CLR3_SD3FLT4_COMPH   0x400000U     // Input Flag Clear for SD3FLT4_COMPH Signal
#define XBAR_CLR3_SD3FLT4_COMPL   0x800000U     // Input Flag Clear for SD3FLT4_COMPL Signal
#define XBAR_CLR3_SD4FLT1_COMPH   0x1000000U    // Input Flag Clear for SD4FLT1_COMPH Signal
#define XBAR_CLR3_SD4FLT1_COMPL   0x2000000U    // Input Flag Clear for SD4FLT1_COMPL Signal
#define XBAR_CLR3_SD4FLT2_COMPH   0x4000000U    // Input Flag Clear for SD4FLT2_COMPH Signal
#define XBAR_CLR3_SD4FLT2_COMPL   0x8000000U    // Input Flag Clear for SD4FLT2_COMPL Signal
#define XBAR_CLR3_SD4FLT3_COMPH   0x10000000U   // Input Flag Clear for SD4FLT3_COMPH Signal
#define XBAR_CLR3_SD4FLT3_COMPL   0x20000000U   // Input Flag Clear for SD4FLT3_COMPL Signal
#define XBAR_CLR3_SD4FLT4_COMPH   0x40000000U   // Input Flag Clear for SD4FLT4_COMPH Signal
#define XBAR_CLR3_SD4FLT4_COMPL   0x80000000U   // Input Flag Clear for SD4FLT4_COMPL Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR4 register
//
//*************************************************************************************************
#define XBAR_CLR4_INPUT1    0x1U          // Input Flag Clear for INPUT1 Signal
#define XBAR_CLR4_INPUT2    0x2U          // Input Flag Clear for INPUT2 Signal
#define XBAR_CLR4_INPUT3    0x4U          // Input Flag Clear for INPUT3 Signal
#define XBAR_CLR4_INPUT4    0x8U          // Input Flag Clear for INPUT4 Signal
#define XBAR_CLR4_INPUT5    0x10U         // Input Flag Clear for INPUT5 Signal
#define XBAR_CLR4_INPUT6    0x20U         // Input Flag Clear for INPUT6 Signal
#define XBAR_CLR4_INPUT7    0x40U         // Input Flag Clear for INPUT7 Signal
#define XBAR_CLR4_INPUT8    0x80U         // Input Flag Clear for INPUT8 Signal
#define XBAR_CLR4_INPUT9    0x100U        // Input Flag Clear for INPUT9 Signal
#define XBAR_CLR4_INPUT10   0x200U        // Input Flag Clear for INPUT10 Signal
#define XBAR_CLR4_INPUT11   0x400U        // Input Flag Clear for INPUT11 Signal
#define XBAR_CLR4_INPUT12   0x800U        // Input Flag Clear for INPUT12 Signal
#define XBAR_CLR4_INPUT13   0x1000U       // Input Flag Clear for INPUT13 Signal
#define XBAR_CLR4_INPUT14   0x2000U       // Input Flag Clear for INPUT14 Signal
#define XBAR_CLR4_INPUT15   0x4000U       // Input Flag Clear for INPUT15 Signal
#define XBAR_CLR4_INPUT16   0x8000U       // Input Flag Clear for INPUT16 Signal
#define XBAR_CLR4_INPUT17   0x10000U      // Input Flag Clear for INPUT17 Signal
#define XBAR_CLR4_INPUT18   0x20000U      // Input Flag Clear for INPUT18 Signal
#define XBAR_CLR4_INPUT19   0x40000U      // Input Flag Clear for INPUT19 Signal
#define XBAR_CLR4_INPUT20   0x80000U      // Input Flag Clear for INPUT20 Signal
#define XBAR_CLR4_INPUT21   0x100000U     // Input Flag Clear for INPUT21 Signal
#define XBAR_CLR4_INPUT22   0x200000U     // Input Flag Clear for INPUT22 Signal
#define XBAR_CLR4_INPUT23   0x400000U     // Input Flag Clear for INPUT23 Signal
#define XBAR_CLR4_INPUT24   0x800000U     // Input Flag Clear for INPUT24 Signal
#define XBAR_CLR4_INPUT25   0x1000000U    // Input Flag Clear for INPUT25 Signal
#define XBAR_CLR4_INPUT26   0x2000000U    // Input Flag Clear for INPUT26 Signal
#define XBAR_CLR4_INPUT27   0x4000000U    // Input Flag Clear for INPUT27 Signal
#define XBAR_CLR4_INPUT28   0x8000000U    // Input Flag Clear for INPUT28 Signal
#define XBAR_CLR4_INPUT29   0x10000000U   // Input Flag Clear for INPUT29 Signal
#define XBAR_CLR4_INPUT30   0x20000000U   // Input Flag Clear for INPUT30 Signal
#define XBAR_CLR4_INPUT31   0x40000000U   // Input Flag Clear for INPUT31 Signal
#define XBAR_CLR4_INPUT32   0x80000000U   // Input Flag Clear for INPUT32 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR5 register
//
//*************************************************************************************************
#define XBAR_CLR5_ADCAEVT1            0x1U          // Input Flag Clear for ADCAEVT1 Signal
#define XBAR_CLR5_ADCAEVT2            0x2U          // Input Flag Clear for ADCAEVT2 Signal
#define XBAR_CLR5_ADCAEVT3            0x4U          // Input Flag Clear for ADCAEVT3 Signal
#define XBAR_CLR5_ADCAEVT4            0x8U          // Input Flag Clear for ADCAEVT4 Signal
#define XBAR_CLR5_ADCBEVT1            0x10U         // Input Flag Clear for ADCBEVT1 Signal
#define XBAR_CLR5_ADCBEVT2            0x20U         // Input Flag Clear for ADCBEVT2 Signal
#define XBAR_CLR5_ADCBEVT3            0x40U         // Input Flag Clear for ADCBEVT3 Signal
#define XBAR_CLR5_ADCBEVT4            0x80U         // Input Flag Clear for ADCBEVT4 Signal
#define XBAR_CLR5_ADCCEVT1            0x100U        // Input Flag Clear for ADCCEVT1 Signal
#define XBAR_CLR5_ADCCEVT2            0x200U        // Input Flag Clear for ADCCEVT2 Signal
#define XBAR_CLR5_ADCCEVT3            0x400U        // Input Flag Clear for ADCCEVT3 Signal
#define XBAR_CLR5_ADCCEVT4            0x800U        // Input Flag Clear for ADCCEVT4 Signal
#define XBAR_CLR5_ADCDEVT1            0x1000U       // Input Flag Clear for ADCDEVT1 Signal
#define XBAR_CLR5_ADCDEVT2            0x2000U       // Input Flag Clear for ADCDEVT2 Signal
#define XBAR_CLR5_ADCDEVT3            0x4000U       // Input Flag Clear for ADCDEVT3 Signal
#define XBAR_CLR5_ADCDEVT4            0x8000U       // Input Flag Clear for ADCDEVT4 Signal
#define XBAR_CLR5_ADCEEVT1            0x10000U      // Input Flag Clear for ADCEEVT1 Signal
#define XBAR_CLR5_ADCEEVT2            0x20000U      // Input Flag Clear for ADCEEVT2 Signal
#define XBAR_CLR5_ADCEEVT3            0x40000U      // Input Flag Clear for ADCEEVT3 Signal
#define XBAR_CLR5_ADCEEVT4            0x80000U      // Input Flag Clear for ADCEEVT4 Signal
#define XBAR_CLR5_CPU1_ADCCHECKEVT1   0x100000U     // Input Flag Clear for CPU1_ADCCHECKEVT1
                                                    // Signal
#define XBAR_CLR5_CPU1_ADCCHECKEVT2   0x200000U     // Input Flag Clear for CPU1_ADCCHECKEVT2
                                                    // Signal
#define XBAR_CLR5_CPU1_ADCCHECKEVT3   0x400000U     // Input Flag Clear for CPU1_ADCCHECKEVT3
                                                    // Signal
#define XBAR_CLR5_CPU1_ADCCHECKEVT4   0x800000U     // Input Flag Clear for CPU1_ADCCHECKEVT4
                                                    // Signal
#define XBAR_CLR5_CPU2_ADCCHECKEVT1   0x1000000U    // Input Flag Clear for CPU2_ADCCHECKEVT1
                                                    // Signal
#define XBAR_CLR5_CPU2_ADCCHECKEVT2   0x2000000U    // Input Flag Clear for CPU2_ADCCHECKEVT2
                                                    // Signal
#define XBAR_CLR5_CPU2_ADCCHECKEVT3   0x4000000U    // Input Flag Clear for CPU2_ADCCHECKEVT3
                                                    // Signal
#define XBAR_CLR5_CPU2_ADCCHECKEVT4   0x8000000U    // Input Flag Clear for CPU2_ADCCHECKEVT4
                                                    // Signal
#define XBAR_CLR5_CPU3_ADCCHECKEVT1   0x10000000U   // Input Flag Clear for CPU3_ADCCHECKEVT1
                                                    // Signal
#define XBAR_CLR5_CPU3_ADCCHECKEVT2   0x20000000U   // Input Flag Clear for CPU3_ADCCHECKEVT2
                                                    // Signal
#define XBAR_CLR5_CPU3_ADCCHECKEVT3   0x40000000U   // Input Flag Clear for CPU3_ADCCHECKEVT3
                                                    // Signal
#define XBAR_CLR5_CPU3_ADCCHECKEVT4   0x80000000U   // Input Flag Clear for CPU3_ADCCHECKEVT4
                                                    // Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR6 register
//
//*************************************************************************************************
#define XBAR_CLR6_CLB1_OUT4       0x1U          // Input Flag Clear for CLB1_OUT4 Signal
#define XBAR_CLR6_CLB1_OUT5       0x2U          // Input Flag Clear for CLB1_OUT5 Signal
#define XBAR_CLR6_CLB2_OUT4       0x4U          // Input Flag Clear for CLB2_OUT4 Signal
#define XBAR_CLR6_CLB2_OUT5       0x8U          // Input Flag Clear for CLB2_OUT5 Signal
#define XBAR_CLR6_CLB3_OUT4       0x10U         // Input Flag Clear for CLB3_OUT4 Signal
#define XBAR_CLR6_CLB3_OUT5       0x20U         // Input Flag Clear for CLB3_OUT5 Signal
#define XBAR_CLR6_CLB4_OUT4       0x40U         // Input Flag Clear for CLB4_OUT4 Signal
#define XBAR_CLR6_CLB4_OUT5       0x80U         // Input Flag Clear for CLB4_OUT5 Signal
#define XBAR_CLR6_CLB5_OUT4       0x100U        // Input Flag Clear for CLB5_OUT4 Signal
#define XBAR_CLR6_CLB5_OUT5       0x200U        // Input Flag Clear for CLB5_OUT5 Signal
#define XBAR_CLR6_CLB6_OUT4       0x400U        // Input Flag Clear for CLB6_OUT4 Signal
#define XBAR_CLR6_CLB6_OUT5       0x800U        // Input Flag Clear for CLB6_OUT5 Signal
#define XBAR_CLR6_FSIA_RX_TRIG1   0x10000U      // Input Flag Clear for FSIA_RX_TRIG1 Signal
#define XBAR_CLR6_FSIB_RX_TRIG1   0x20000U      // Input Flag Clear for FSIB_RX_TRIG1 Signal
#define XBAR_CLR6_FSIC_RX_TRIG1   0x40000U      // Input Flag Clear for FSIC_RX_TRIG1 Signal
#define XBAR_CLR6_FSID_RX_TRIG1   0x80000U      // Input Flag Clear for FSID_RX_TRIG1 Signal
#define XBAR_CLR6_WADI1OUT0       0x400000U     // Input Flag Clear for WADI1OUT0 Signal
#define XBAR_CLR6_WADI1OUT1       0x800000U     // Input Flag Clear for WADI1OUT1 Signal
#define XBAR_CLR6_WADI1OUT2       0x1000000U    // Input Flag Clear for WADI1OUT2 Signal
#define XBAR_CLR6_WADI1OUT3       0x2000000U    // Input Flag Clear for WADI1OUT3 Signal
#define XBAR_CLR6_WADI1OUT4       0x4000000U    // Input Flag Clear for WADI1OUT4 Signal
#define XBAR_CLR6_WADI1OUT5       0x8000000U    // Input Flag Clear for WADI1OUT5 Signal
#define XBAR_CLR6_WADI1OUT6       0x10000000U   // Input Flag Clear for WADI1OUT6 Signal
#define XBAR_CLR6_WADI1OUT7       0x20000000U   // Input Flag Clear for WADI1OUT7 Signal
#define XBAR_CLR6_ECATSYNC0       0x40000000U   // Input Flag Clear for ECATSYNC0 Signal
#define XBAR_CLR6_ECATSYNC1       0x80000000U   // Input Flag Clear for ECATSYNC1 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR7 register
//
//*************************************************************************************************
#define XBAR_CLR7_ECAP1_OUT       0x1U          // Input Flag Clear for ECAP1_OUT Signal
#define XBAR_CLR7_ECAP2_OUT       0x2U          // Input Flag Clear for ECAP2_OUT Signal
#define XBAR_CLR7_ECAP3_OUT       0x4U          // Input Flag Clear for ECAP3_OUT Signal
#define XBAR_CLR7_ECAP4_OUT       0x8U          // Input Flag Clear for ECAP4_OUT Signal
#define XBAR_CLR7_ECAP5_OUT       0x10U         // Input Flag Clear for ECAP5_OUT Signal
#define XBAR_CLR7_ECAP6_OUT       0x20U         // Input Flag Clear for ECAP6_OUT Signal
#define XBAR_CLR7_ECAP1_TRIPOUT   0x100U        // Input Flag Clear for ECAP1_TRIPOUT Signal
#define XBAR_CLR7_ECAP2_TRIPOUT   0x200U        // Input Flag Clear for ECAP2_TRIPOUT Signal
#define XBAR_CLR7_ECAP3_TRIPOUT   0x400U        // Input Flag Clear for ECAP3_TRIPOUT Signal
#define XBAR_CLR7_ECAP4_TRIPOUT   0x800U        // Input Flag Clear for ECAP4_TRIPOUT Signal
#define XBAR_CLR7_ECAP5_TRIPOUT   0x1000U       // Input Flag Clear for ECAP5_TRIPOUT Signal
#define XBAR_CLR7_ECAP6_TRIPOUT   0x2000U       // Input Flag Clear for ECAP6_TRIPOUT Signal
#define XBAR_CLR7_ADCSOCA         0x10000U      // Input Flag Clear for ADCSOCA Signal
#define XBAR_CLR7_ADCSOCB         0x20000U      // Input Flag Clear for ADCSOCB Signal
#define XBAR_CLR7_ESMGENEVT       0x40000U      // Input Flag Clear for ESMGENEVT Signal
#define XBAR_CLR7_EXTSYNCOUT      0x80000U      // Input Flag Clear for EXTSYNCOUT Signal
#define XBAR_CLR7_WADI2OUT0       0x1000000U    // Input Flag Clear for WADI2OUT0 Signal
#define XBAR_CLR7_WADI2OUT1       0x2000000U    // Input Flag Clear for WADI2OUT1 Signal
#define XBAR_CLR7_WADI2OUT2       0x4000000U    // Input Flag Clear for WADI2OUT2 Signal
#define XBAR_CLR7_WADI2OUT3       0x8000000U    // Input Flag Clear for WADI2OUT3 Signal
#define XBAR_CLR7_WADI2OUT4       0x10000000U   // Input Flag Clear for WADI2OUT4 Signal
#define XBAR_CLR7_WADI2OUT5       0x20000000U   // Input Flag Clear for WADI2OUT5 Signal
#define XBAR_CLR7_WADI2OUT6       0x40000000U   // Input Flag Clear for WADI2OUT6 Signal
#define XBAR_CLR7_WADI2OUT7       0x80000000U   // Input Flag Clear for WADI2OUT7 Signal

//*************************************************************************************************
//
// The following are defines for the bit fields in the XBARCLR8 register
//
//*************************************************************************************************
#define XBAR_CLR8_EPWM1_TRIPOUT    0x1U       // Input Flag clear for EPWM1_TRIPOUT Signal
#define XBAR_CLR8_EPWM2_TRIPOUT    0x2U       // Input Flag clear for EPWM2_TRIPOUT Signal
#define XBAR_CLR8_EPWM3_TRIPOUT    0x4U       // Input Flag clear for EPWM3_TRIPOUT Signal
#define XBAR_CLR8_EPWM4_TRIPOUT    0x8U       // Input Flag clear for EPWM4_TRIPOUT Signal
#define XBAR_CLR8_EPWM5_TRIPOUT    0x10U      // Input Flag clear for EPWM5_TRIPOUT Signal
#define XBAR_CLR8_EPWM6_TRIPOUT    0x20U      // Input Flag clear for EPWM6_TRIPOUT Signal
#define XBAR_CLR8_EPWM7_TRIPOUT    0x40U      // Input Flag clear for EPWM7_TRIPOUT Signal
#define XBAR_CLR8_EPWM8_TRIPOUT    0x80U      // Input Flag clear for EPWM8_TRIPOUT Signal
#define XBAR_CLR8_EPWM9_TRIPOUT    0x100U     // Input Flag clear for EPWM9_TRIPOUT Signal
#define XBAR_CLR8_EPWM10_TRIPOUT   0x200U     // Input Flag clear for EPWM10_TRIPOUT Signal
#define XBAR_CLR8_EPWM11_TRIPOUT   0x400U     // Input Flag clear for EPWM11_TRIPOUT Signal
#define XBAR_CLR8_EPWM12_TRIPOUT   0x800U     // Input Flag clear for EPWM12_TRIPOUT Signal
#define XBAR_CLR8_EPWM13_TRIPOUT   0x1000U    // Input Flag clear for EPWM13_TRIPOUT Signal
#define XBAR_CLR8_EPWM14_TRIPOUT   0x2000U    // Input Flag clear for EPWM14_TRIPOUT Signal
#define XBAR_CLR8_EPWM15_TRIPOUT   0x4000U    // Input Flag clear for EPWM15_TRIPOUT Signal
#define XBAR_CLR8_EPWM16_TRIPOUT   0x8000U    // Input Flag clear for EPWM16_TRIPOUT Signal
#define XBAR_CLR8_EPWM17_TRIPOUT   0x10000U   // Input Flag clear for EPWM17_TRIPOUT Signal
#define XBAR_CLR8_EPWM18_TRIPOUT   0x20000U   // Input Flag clear for EPWM18_TRIPOUT Signal

